# Pandas Advanced Assignment

### Q1. List any five functions of the pandas library with execution.

Functions in Pandas:
- read_csv(), read_xml(), read_json()
- head()
- Series()
- Categorical
- tail()

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [3]:
data = [4, 8, 15, 16, 23, 42]
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
pd.Categorical(df['Pclass'])

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [5]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
data = [
    { "Name": "Alice", "Age": "25", "Gender": "Female"},
    { "Name": "Bob", "Age": "30", "Gender": "Male"},
    { "Name": "Clair", "Age": "27", "Gender": "Female"}
]
df1 = pd.DataFrame(data)
df1

    Name Age  Gender
0  Alice  25  Female
1    Bob  30    Male
2  Clair  27  Female

In [7]:
df2 = df1.reindex(index=list(range(1, len(df1)*2, 2)))
df2

  Name  Age Gender
1  Bob   30   Male
3  NaN  NaN    NaN
5  NaN  NaN    NaN

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
##### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [8]:
col1 = pd.Series(["A", "B", "C", "D", "E"])
col2 = pd.Series([10, 20, 30, 40, 50])

df3 = pd.DataFrame({
    "Sr_No": col1,
    "Values": col2
})

my_sum = 0
j = 0
for i in df3["Values"]:
    if (j < 3):
        my_sum +=i
        j = j+1
    else:
        break;
    
my_sum

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [9]:
df1["Word_Count"] = df1["Name"].apply(len)
df1

    Name Age  Gender  Word_Count
0  Alice  25  Female           5
1    Bob  30    Male           3
2  Clair  27  Female           5

### Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size - This will return the number of total elements in the data table.

DataFrame.shape - This will return the number of rows and columns.

In [10]:
print("df1.size:", df1.size)
print("df1.shape:", df1.shape)

df1.size: 12
df1.shape: (3, 4)

### Q6. Which function of pandas do we use to read an excel file?

pandas.read_excel("fileNameGoesHere") - This function is used to read the excel files.

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [11]:
df2 = pd.DataFrame([
    { "email": "swapneel@email.com" },
    { "email": "swap1122@email.com" },
    { "email": "neil.p@email.com" },
    { "email": "abc@email.com" },
    { "email": "def@email.com" }
])
df2["username"] = df2["email"].apply(lambda x: x.split('@')[0])
df2

                email  username
0  swapneel@email.com  swapneel
1  swap1122@email.com  swap1122
2    neil.p@email.com    neil.p
3       abc@email.com       abc
4       def@email.com       def

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [12]:
a = pd.Series([3,8,6,2,9])
b = pd.Series([5,2,9,3,1])
c = pd.Series([1,7,4,5,2])

df4 = pd.DataFrame({
    "A": a,
    "B": b,
    "C": c
})

df5 = df4[(df4["A"] > 5) & (df4["B"] < 10)]
df5

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [13]:
df4.describe()[1:4]

            A         B         C
mean  5.60000  4.000000  3.800000
std   3.04959  3.162278  2.387467
min   2.00000  1.000000  1.000000

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [14]:
data = pd.Series(['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05'])
df6 = pd.DataFrame({"Date": data})
df6

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [17]:
import datetime as dt

def get_day(date):
    d = date.split('-')
    a = dt.datetime(int(d[0]), int(d[1]), int(d[2]));
    return a.strftime("%A")

df6["Weekday"] = df6["Date"].apply(lambda x: get_day(x))

df6

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [39]:
df7 = pd.DataFrame({
                   'date' : ['2023-01-09', '2023-08-25', '2023-09-05', 
                            '2023-01-12', '2023-01-29', '2023-10-15', 
                            '2023-11-21', '2023-01-02', '2023-12-10', 
                            '2023-12-18']})
df7['date'] = pd.to_datetime(df7['date'], format='%Y-%m-%d')
df7

df7.loc[(df7['date'] >= '2023-01-01') & (df7['date'] < '2023-01-31')]

        date
0 2023-01-09
3 2023-01-12
4 2023-01-29
7 2023-01-02

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

We need to import pandas